# 资料筛选

In [3]:
import numpy as np
import pandas as pd

In [2]:
#df.ix[1]#第一列

In [5]:
#df.ix[1:4]

In [6]:
#df['name']  #取某一栏资料

In [7]:
#df[['name','age']]

In [8]:
#df.ix[1:2,['name','age']]   #根据索引号和名称筛选数据

In [9]:
import pandas as pd
df=pd.DataFrame([['frank','M',29],['mary','F',23],['tom','M',35],['ted','M',33],['jean','F',21],['lisa','F',20]])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [10]:
df.head()

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21

In [11]:
df.ix[1]

0    mary
1       F
2      23
Name: 1, dtype: object

In [12]:
df.ix[1:4]

      0  1   2
1  mary  F  23
2   tom  M  35
3   ted  M  33
4  jean  F  21

In [14]:
df.columns=['name','gender','age']#加列名
df

    name gender age
0  frank      M  29
1   mary      F  23
2    tom      M  35
3    ted      M  33
4   jean      F  21
5   lisa      F  20

In [15]:
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [16]:
df[['name','age']]

    name age
0  frank  29
1   mary  23
2    tom  35
3    ted  33
4   jean  21
5   lisa  20

In [17]:
df.ix[1:2,['name','age']]

   name age
1  mary  23
2   tom  35

In [18]:
?df.ix

In [19]:
df

    name gender age
0  frank      M  29
1   mary      F  23
2    tom      M  35
3    ted      M  33
4   jean      F  21
5   lisa      F  20

In [20]:
df['gender']

0    M
1    F
2    M
3    M
4    F
5    F
Name: gender, dtype: object

In [21]:
df.gender

0    M
1    F
2    M
3    M
4    F
5    F
Name: gender, dtype: object

In [22]:
df['gender'] == 'M'

0     True
1    False
2     True
3     True
4    False
5    False
Name: gender, dtype: bool

In [24]:
df[df['gender'] == 'M']#筛选男性数据

    name gender age
0  frank      M  29
2    tom      M  35
3    ted      M  33

In [32]:
df['age']

0    29
1    23
2    35
3    33
4    21
5    20
Name: age, dtype: object

In [66]:
df[df['age']>30]

TypeError: unorderable types: str() > int()

In [67]:
df[(df['gender'] == 'M')&(df['age']>30)]

TypeError: unorderable types: str() > int()

In [36]:
df[(df['gender'] == 'M')|(df['age']>30)]

TypeError: unorderable types: str() > int()

In [38]:
df['employee'] = True

In [39]:
df.head()

    name gender age employee
0  frank      M  29     True
1   mary      F  23     True
2    tom      M  35     True
3    ted      M  33     True
4   jean      F  21     True

In [40]:
del df['employee']

In [41]:
df

    name gender age
0  frank      M  29
1   mary      F  23
2    tom      M  35
3    ted      M  33
4   jean      F  21
5   lisa      F  20

In [42]:
df['employee'] = True
df

    name gender age employee
0  frank      M  29     True
1   mary      F  23     True
2    tom      M  35     True
3    ted      M  33     True
4   jean      F  21     True
5   lisa      F  20     True

In [43]:
df.drop('employee',axis = 1) #在显示时不显示

    name gender age
0  frank      M  29
1   mary      F  23
2    tom      M  35
3    ted      M  33
4   jean      F  21
5   lisa      F  20

In [44]:
df

    name gender age employee
0  frank      M  29     True
1   mary      F  23     True
2    tom      M  35     True
3    ted      M  33     True
4   jean      F  21     True
5   lisa      F  20     True

In [45]:
df = df.drop('employee',axis = 1)#真正删除掉

In [46]:
df

    name gender age
0  frank      M  29
1   mary      F  23
2    tom      M  35
3    ted      M  33
4   jean      F  21
5   lisa      F  20

In [47]:
#新增，删除栏位
df.loc[5]

name      lisa
gender       F
age         20
Name: 5, dtype: object

In [48]:
df.loc[6] = {'age':20,'gender':'F','name':'qoo'}

In [49]:
df

    name gender age
0  frank      M  29
1   mary      F  23
2    tom      M  35
3    ted      M  33
4   jean      F  21
5   lisa      F  20
6    qoo      F  20

In [50]:
df.drop(6)
df

    name gender age
0  frank      M  29
1   mary      F  23
2    tom      M  35
3    ted      M  33
4   jean      F  21
5   lisa      F  20
6    qoo      F  20

In [51]:
df = df.drop(6)

In [52]:
df

    name gender age
0  frank      M  29
1   mary      F  23
2    tom      M  35
3    ted      M  33
4   jean      F  21
5   lisa      F  20

In [55]:
df.append(pd.DataFrame([{'age':20,'gender':'F','name':'qoo'}]),ignore_index=True)

  age gender   name
0  29      M  frank
1  23      F   mary
2  35      M    tom
3  33      M    ted
4  21      F   jean
5  20      F   lisa
6  20      F    qoo

In [56]:
df

    name gender age
0  frank      M  29
1   mary      F  23
2    tom      M  35
3    ted      M  33
4   jean      F  21
5   lisa      F  20

In [57]:
df = df.append(pd.DataFrame([{'age':20,'gender':'F','name':'qoo'}]),ignore_index=True)
df

  age gender   name
0  29      M  frank
1  23      F   mary
2  35      M    tom
3  33      M    ted
4  21      F   jean
5  20      F   lisa
6  20      F    qoo

In [58]:
df = df.drop(6)

In [59]:
df

  age gender   name
0  29      M  frank
1  23      F   mary
2  35      M    tom
3  33      M    ted
4  21      F   jean
5  20      F   lisa

In [64]:
#设定新的索引
df['userid'] = range(101,107)
df

       age gender   name  userid
userid
101     29      M  frank     101
102     23      F   mary     102
103     35      M    tom     103
104     33      M    ted     104
105     21      F   jean     105
106     20      F   lisa     106

In [65]:
df.set_index('userid',inplace=True)
df

       age gender   name
userid
101     29      M  frank
102     23      F   mary
103     35      M    tom
104     33      M    ted
105     21      F   jean
106     20      F   lisa

In [68]:
#取值
df.iloc[]